app/controllers/bookings_controller.rb

  def index

    @bookings = Booking.where(user_id: current_user.id)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]

  def create
    #using this if only give give access to users with only api
    if current_user
      user = current_user.id
    else
      user = params[:user]
    end
    #allowing user to book with room number as well from UI
    if params[:room_number]
      params[:room_type] = Room.where(id: params[:room_number]).first.room_type_id
    end
    if params[:start_date] == '' or params[:end_date] == '' or user == '' or params[:room_type] ==''
      render json: {errors: 'need all fields'}, status: 500
    elsif Date.parse(params[:start_date]) >  6.months.from_now
      render json: {error: 'booking not allowed before 6 months'}, status: 500
    else
      rooms = Booking.check_booking_availbility params[:start_date], params[:end_date], params[:room_type]
      if rooms.count > 0
        booking = Booking.create(start_date: params[:start_date], end_date: params[:end_date], room: rooms.first, user_id: user, booking_status_id: 1)
---
SELECT  "room_types".* FROM "room_types" WHERE "room_types"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."room_type_id" = $1 AND ("rooms"."id" != 76)  ORDER BY "rooms"."id" ASC LIMIT 1  [["room_type_id", 5]]
INSERT INTO "bookings" ("start_date", "end_date", "room_id", "user_id", "booking_status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"